[
  {
    "_id": "4",
    "title": "Fast Grocer - A E-commerce Grocery Website",
    "des": "The website also includes a personalized shopping feature, allowing customers to save their favorite products and create custom shopping lists. This feature makes it easy to reorder items that you purchase frequently, streamlining the shopping experience even further. This fast grocery main goal is to deliver the right quality speakers in a short period of time at low cost. The entire website is user friendly and users can navigate the website as they wish. For example, users can search for the desired product. Can load category wise product. Add to cart, wish list, can do. Product price sorting and more. Three types of users can use this website admin delivery man and buyer. The website will navigate according to each user's role. For admin can see all delivery man and buyer. All available products and also add a new product can delete unnecessary products and maintain the completed websites. Admin Can see how much money per order .Overall, Fast Grocer is an all-in-one solution for anyone looking for a fast, convenient, and reliable way to purchase groceries online. With its extensive range of products, personalized shopping features, and multiple delivery options, Fast Grocer makes grocery shopping a hassle-free experience, allowing customers to spend more time doing the things they love.",
    "features": [
      "Wide variety of groceries including fresh products, meat, dairy, baked goods, and pantry staples",
      "User-friendly interface for easy product browsing and searching",
      "Shopping cart and wishlist creation",
      "Order tracking",
      "Fast and convenient home delivery or in-store pickup at select locations",
      "Payment options including credit/debit cards, net banking, and cash on delivery",
      "Customer account creation for easy ordering and tracking",
      "easy to use filter and sorting options to find the desired products.",
      "Product reviews and ratings",
      "Option to subscribe for regular delivery of essential items"
    ],
    "live": "https://fast-grocer-client.vercel.app/",
    "github": "https://github.com/Team-Hexagon-607-2/fast-grocer-client",
    "techs": "MERN ( MongoDB, ExpressJs, ReactJs, NodeJs), firebase, vercel, Axios, JWT, Socket io, ",
    "tumbleImg": "https://i.ibb.co/p0Tr9y9/fast-grocer.png",
    "images": [
      "https://i.ibb.co/VmF7hLf/product-Category.png",
      "https://i.ibb.co/fMDNTd2/search.png",
      "https://i.ibb.co/RYPpxbx/aboutUs.png",
      "https://i.ibb.co/7p51nvZ/dashboard.png",
      "https://i.ibb.co/L9hWDZd/Enventory.png",
      "https://i.ibb.co/Rjz0TK7/chart.png"
    ]
  },
  {
    "_id": "1",
    "title": "Buy & Resale - A Resell mobiles website",
    "des": "Buy & Resale is a mobile resale web app using MERN stack. Implemented order system , login system, order management, product management, user Authorization set admin, seller and buyer etc.",
    "features": [
      "Developed a REST API for CRUD operations and stored all data in MongoDB.",
      "The Stripe payment gateway should be implemented for the purchase of products.",
      "Using React Router Dom, implement Public, Private, Buyer, Seller & Admin Route.",
      "Admin can see -> All Seller, All Buyers, report product",
      "Seller can view his products, delete and add new product.",
      "Buyer can manage her order"
    ],
    "live": "https://buy-cell--web.web.app/",
    "github": "https://github.com/programming-hero-web-course-4/b612-used-products-resale-clients-side-saruaralam-swd",
    "techs": "MongoDB, ExpressJs, ReactJs, NodeJs, firebase, vercel, Axios, JWT, react-router-dom",
    "tumbleImg": "https://i.ibb.co/K9f1Dy1/buy-And-Sell.png",
    "images": [
      "https://i.ibb.co/DfhcT5y/advertisment.png",
      "https://i.ibb.co/YWjFmpN/categoris-product.png",
      "https://i.ibb.co/1XybQKk/dashboard-admin.png",
      "https://i.ibb.co/2skRpC0/dashboard-seller.png",
      "https://i.ibb.co/mFp0SvX/dashboard-buyer.png"
    ]
  },
  {
    "_id": "2",
    "title": "KitoGoo - A personal travel Agency",
    "des": "KitoGoo is a tour managing agency web app using MERN Stack. providing tour event managing services like booking cottages, hiring boats, managing kayaking, skiing, etc. Here people can find places to go somewhere and book necessary things right on the website by login in and providing information on the booking page.",
    "features": [
      "Design is created by React JS and Tailwind CSS and Daisy Ui",
      "For storing user information applied authentication and authorization using JWT.",
      "Users can create/edit/delete their reviews."
    ],
    "live": "https://kitogoo-b0158.web.app/",
    "github": "https://github.com/saruaralam-swd/kitogoo-client",
    "techs": "MongoDB, ExpressJs, ReactJs, NodeJs, react-router-dom, Firebase, TailwindCss",
    "tumbleImg": "https://i.ibb.co/gm1b3rG/kitoGoo.png",
    "images": [
      "https://i.ibb.co/tCyD0Fd/all-services-1.png",
      "https://i.ibb.co/6WrL7X9/product-details-2.png",
      "https://i.ibb.co/LpQpNrP/all-lmy-review-4.png",
      "https://i.ibb.co/x8VHJ3j/my-review-4.png"
    ]
  },
  {
    "_id": "3",
    "title": "Educrat - A online course learning platform",
    "des": "Educrate is online course platform website. this website provide programming courses. Educrate for programming courses can help you advance your skills. Looking to gain experience with Android app development? Start Courses Today. ",
    "features": [
      "Dynamically course loaded, filtering by categories & type using React, Express JS & MongoDB. Applied",
      "Dynamic course details route & download course PDF used react-to-PDF",
      "Private Checkout route forcing to login & authenticate by Firebase, React router and Context API"
    ],
    "live": "https://learning-platform-client-f6cbc.web.app/",
    "github": "https://github.com/saruaralam-swd/educrat-learning-platform-client-side",
    "techs": "MongoDB, ExpressJs, ReactJs, NodeJs, firebase, vercel, Axios, JWT, react-router-dom",
    "tumbleImg": "https://i.ibb.co/2SPm5JW/Educrat.png",
    "images": [
      "https://i.ibb.co/MSwbPzW/home-1.png",
      "https://i.ibb.co/SdRLxzv/course-details-2.png",
      "https://i.ibb.co/F8TKgTs/course-access-3.png"
    ]
  }
]